test/load-test/pin-post_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            6000

Document Path:          /api/pins
Document Length:        183 bytes

Concurrency Level:      10
Time taken for tests:   1.182 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      414000 bytes
Total body sent:        249000
HTML transferred:       183000 bytes
Requests per second:    846.31 [#/sec] (mean)
Time per request:       11.816 [ms] (mean)
Time per request:       1.182 [ms] (mean, across all concurrent requests)
Transfer rate:          342.16 [Kbytes/sec] received
                        205.79 kb/s sent
                        547.95 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     5   12   2.4     11      23
Waiting:        5   12   2.4     11      23
Total:          5   12   2.4     11      23

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     13
  80%     13
  90%     14
  95%     16
  98%     18
  99%     21
 100%     23 (longest request)